# BuiltInFailures.BeamSystemFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..BeamSystemFailures Class
BuiltInFailures Class Members See Also
---
Failures about BeamSystem.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class BeamSystemFailures
```

Visual Basic
---
```text
Public NotInheritable Class BeamSystemFailures
```

Visual C++
---
```text
public ref class BeamSystemFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..BeamSystemFailures
# See Also
BuiltInFailures..::..BeamSystemFailures Members
Autodesk.Revit.DB Namespace